# MultistoryStairsRefLevel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MultistoryStairsRefLevel Property
ParameterTypeId Class See Also
---
"Reference Level": The reference level of stairs
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MultistoryStairsRefLevel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MultistoryStairsRefLevel As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MultistoryStairsRefLevel {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace